yiiF/modules/models/Admin.php

    public function validatePass()
    {
        if (!$this->hasErrors()) {
            $data = self::find()->where('adminuser = :user', [":user" => $this->adminuser])->one();
---
SELECT * FROM `shop_admin` WHERE adminuser = 'admin1'

    public function getAdmin()
    {
        return self::find()->where('adminuser = :user', [':user' => $this->adminuser])->one();
---
SELECT * FROM `shop_admin` WHERE adminuser = 'admin1'

    public static function findIdentity($id)
    {
        return static::findOne($id);
---
SELECT * FROM `shop_admin` WHERE `adminid`='2'