yiiF/models/AuthorRule.php

SELECT * FROM `shop_category` WHERE `cateid`='86'
---
    public function execute($user, $item, $params)
    {
        $action = Yii::$app->controller->action->id;

        if ($action == 'del') {
            $cateid = Yii::$app->request->get("cateid");
            $cate = Category::findOne($cateid);