yiiF/models/Category.php

INSERT INTO `shop_category` (`parentid`, `title`, `createtime`, `adminid`) VALUES ('17', 'çŒªè‚‰', '1520653579', '2')
---
    public function add($data)
    {
        $data['Category']['createtime'] = time();
        if ($this->load($data) && $this->save()) {

SELECT * FROM `shop_category`
---
    public function getData()
    {
        $cates = self::find()->all();

SELECT * FROM `shop_category` WHERE parentid = 0 ORDER BY `createtime` LIMIT 11
SELECT * FROM `shop_category` WHERE parentid = '7' LIMIT 10
---
    public static function getMenu()
    {
        $top = self::find()->where('parentid = :pid', [":pid" => 0])->limit(11)->orderby('createtime asc')->asArray()->all();
        $data = [];
        foreach((array)$top as $k=>$cate) {
            $cate['children'] = self::find()->where("parentid = :pid", [":pid" => $cate['cateid']])->limit(10)->asArray()->all();