yiiF/modules/controllers/CategoryController.php

SELECT * FROM `shop_category` WHERE parentid = '84'
DELETE FROM `shop_category` WHERE cateid = '84'
---
    public function actionDel()
    {
        try {
            $cateid = Yii::$app->request->get('cateid');
            if (empty($cateid)) {
                throw new \Exception('参数错误');
            }
            $data = Category::find()->where('parentid = :pid', [":pid" => $cateid])->one();
            if ($data) {
                throw new \Exception('该分类下有子类，不允许删除');
            }
            if (!Category::deleteAll('cateid = :id', [":id" => $cateid])) {